programming/golang/无闻视频笔记.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-02-25 日 11:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>无闻 Go 视频教程笔记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Zhao WenBin">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">无闻 Go 视频教程笔记</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6404d29">Go 开发环境搭建</a></li>
<li><a href="#org64bead5">Go 基础知识</a></li>
<li><a href="#org994be23">类型与变量</a></li>
<li><a href="#org69a4827">问题</a></li>
<li><a href="#org7b160c0">外部链接</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org6404d29" class="outline-2">
<h2 id="org6404d29">Go 开发环境搭建</h2>
<div class="outline-text-2" id="text-org6404d29">
</div><div id="outline-container-orgabaa4a5" class="outline-3">
<h3 id="orgabaa4a5">Go 基本介绍</h3>
<div class="outline-text-3" id="text-orgabaa4a5">
<ul class="org-ul">
<li>类型安全，内存安全</li>
<li>支持并发</li>
<li>垃圾回收</li>
<li>快速编译（严格要示，不能有未被使用的导入，未使用的变量，不需要头文件）</li>
<li>快速编译</li>
<li>UTF8 支持</li>
</ul>
</div>
</div>

<div id="outline-container-orgc1b4116" class="outline-3">
<h3 id="orgc1b4116">安装，环境变量，目录</h3>
<div class="outline-text-3" id="text-orgc1b4116">
<p>
go 通过环境变量来设置参数，常见的有
</p>

<ul class="org-ul">
<li>GOROOT</li>
<li>GOPATH: 开发目录，其中包括 bin, pkg, src 等</li>
<li>GOARCH</li>
<li>GOHOSTARCH</li>
</ul>

<p>
其中 <code>${GOPATH}/bin</code> 保存生成的可执行文件， <code>${GOPATH}/pkg</code> 下保存生成的具体平台的库文件
</p>
</div>
</div>

<div id="outline-container-orgee39300" class="outline-3">
<h3 id="orgee39300">命令</h3>
<div class="outline-text-3" id="text-orgee39300">
<p>
常见命令有
</p>

<ul class="org-ul">
<li>build &lt;main-src&gt;</li>
<li>install</li>
<li>test</li>
<li>doc</li>
<li>fmt</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org64bead5" class="outline-2">
<h2 id="org64bead5">Go 基础知识</h2>
<div class="outline-text-2" id="text-org64bead5">
</div><div id="outline-container-orgc188d47" class="outline-3">
<h3 id="orgc188d47">关键字</h3>
<div class="outline-text-3" id="text-orgc188d47">
<p>
其有 25 个关键字，其中特殊的如 type, go, defer, interface, chan, default, fallthrough
</p>
</div>
</div>

<div id="outline-container-orgca1164a" class="outline-3">
<h3 id="orgca1164a">注释方法</h3>
<div class="outline-text-3" id="text-orgca1164a">
<p>
与 C++ 相同
</p>
</div>
</div>

<div id="outline-container-org5f61fec" class="outline-3">
<h3 id="org5f61fec">代码文件的一般结构</h3>
<div class="outline-text-3" id="text-org5f61fec">
<ol class="org-ol">
<li>package</li>
<li>import</li>
<li>const</li>
<li>var</li>
<li>type 定义 struct 或 interface</li>
<li>func</li>
</ol>
</div>
</div>

<div id="outline-container-org7c224c4" class="outline-3">
<h3 id="org7c224c4">import 小技巧</h3>
<div class="outline-text-3" id="text-org7c224c4">
<ol class="org-ol">
<li>别名： <code>import std "fmt"</code></li>
<li>省略调用： <code>import . "fmt"</code> ，类似于 python 中 <code>from fmt import *</code> ，慎用!</li>
</ol>
</div>
</div>

<div id="outline-container-org27869db" class="outline-3">
<h3 id="org27869db">可见性规则</h3>
<div class="outline-text-3" id="text-org27869db">
<p>
通过首字母大写来判定可见性
</p>
</div>
</div>

<div id="outline-container-org43eed05" class="outline-3">
<h3 id="org43eed05">import, var, const 简写</h3>
<div class="outline-text-3" id="text-org43eed05">
<p>
对于多个 import, var, const 可以合并，写在圆括号内（并可以用一条注释整体）
</p>
</div>
</div>
</div>

<div id="outline-container-org994be23" class="outline-2">
<h2 id="org994be23">类型与变量</h2>
<div class="outline-text-2" id="text-org994be23">
</div><div id="outline-container-orgc42a89d" class="outline-3">
<h3 id="orgc42a89d">基本类型</h3>
<div class="outline-text-3" id="text-orgc42a89d">
<ul class="org-ul">
<li>布尔型: bool，取值只能是 true 或者 false</li>
<li>整型: uint/int（平台相关大小），uint/int{8,16,32,64} 指定范围</li>
<li>字节型: byte，是 uint8 的别名</li>
<li>rune 型: 是 int32 的别名</li>
<li>浮点型: float32/float64</li>
<li>复数: complex64/complex128</li>
<li>指针: uintptr（与平台有关）</li>
</ul>
</div>
</div>

<div id="outline-container-org77a00fd" class="outline-3">
<h3 id="org77a00fd">复合类型</h3>
<div class="outline-text-3" id="text-org77a00fd">
<ul class="org-ul">
<li>array</li>
<li>struct</li>
<li>string</li>
<li>slice</li>
<li>map</li>
<li>chan</li>
<li>interface</li>
<li>func: 第一类成员</li>
</ul>
</div>
</div>

<div id="outline-container-orgf6e99ce" class="outline-3">
<h3 id="orgf6e99ce">零值</h3>
<div class="outline-text-3" id="text-orgf6e99ce">
<p>
每种类型都有默认零值，如 0, false, ""
</p>
</div>
</div>

<div id="outline-container-orgde7a46a" class="outline-3">
<h3 id="orgde7a46a">类型别名</h3>
<div class="outline-text-3" id="text-orgde7a46a">
<ul class="org-ul">
<li>用 <code>type</code> 来定义别名</li>
<li>使用单独的类型，使逻辑更清晰（也可以定义不同方法）</li>
<li><code>type</code> 可以同 import, var, const 使用圆括号一次定义多个</li>
</ul>
</div>
</div>

<div id="outline-container-orga9b28b6" class="outline-3">
<h3 id="orga9b28b6">math</h3>
<div class="outline-text-3" id="text-orga9b28b6">
<p>
math 模块中有 MaxXX 与 MinXX，表示了不同类型的取值范围
</p>
</div>
</div>

<div id="outline-container-org4f4eda3" class="outline-3">
<h3 id="org4f4eda3">变量的声明与赋值</h3>
<div class="outline-text-3" id="text-org4f4eda3">
<ul class="org-ul">
<li><code>var</code> 声明变量，需要指定类型</li>
<li><code>=</code> 进行赋值，可以对多个变量赋值</li>
<li>声明与赋值可以放在一起进行，这时编译器会自动推导类型，因此类型标注可以省略</li>
<li>在函数内可以用 <code>:=</code> 语法来进行声明与赋值</li>
<li>函数内不可以用 <code>var()</code> 定义多个变量</li>
<li>全局不能使用 <code>:=</code> 语法</li>
</ul>
</div>
</div>

<div id="outline-container-org165a95d" class="outline-3">
<h3 id="org165a95d">空白符号</h3>
<div class="outline-text-3" id="text-org165a95d">
<p>
<code>_</code> 用于捕获无用的变量
</p>
</div>
</div>

<div id="outline-container-orgd015b3f" class="outline-3">
<h3 id="orgd015b3f">类型转换</h3>
<div class="outline-text-3" id="text-orgd015b3f">
<p>
只能在兼容的类型之间进行
</p>
</div>
</div>
</div>


<div id="outline-container-org69a4827" class="outline-2">
<h2 id="org69a4827">问题</h2>
<div class="outline-text-2" id="text-org69a4827">
</div><div id="outline-container-org978f195" class="outline-3">
<h3 id="org978f195"><span class="todo TODO">TODO</span> 类型转换是静态的？还是动态的？有没有开销</h3>
</div>

<div id="outline-container-org7f5761e" class="outline-3">
<h3 id="org7f5761e"><span class="todo TODO">TODO</span> <code>string</code> 与 <code>[]byte</code> 与 <code>[]rune</code> 的关系</h3>
</div>

<div id="outline-container-orga53e83f" class="outline-3">
<h3 id="orga53e83f"><span class="todo TODO">TODO</span> <code>[10]int</code> 与 <code>[]int</code> 的区别</h3>
</div>

<div id="outline-container-org88d75ea" class="outline-3">
<h3 id="org88d75ea"><span class="todo TODO">TODO</span> <code>[...]int{1,2,3}</code> 与 <code>[]int{1,2,3}</code> 的区别</h3>
</div>
</div>

<div id="outline-container-org7b160c0" class="outline-2">
<h2 id="org7b160c0">外部链接</h2>
<div class="outline-text-2" id="text-org7b160c0">
<ul class="org-ul">
<li>Go 在谷歌：以软件工程为目的的语言设计</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Zhao WenBin</p>
<p class="date">Created: 2018-02-25 日 11:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
